helicocystis_straight/velocity/v0.4/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 -0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    leftRightTop
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    Bottom
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    HH
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
}


// ************************************************************************* //
